ckuzma/cypress-sensor-hub/PSoC Firmware/EnvironmentSensing.cydsn/Generated_Source/PSoC4/Rectifier_UABH_B_regs.h
#define Rectifier_UABH_B_SRAM11_ADDR                   (Rectifier_UABH_B_halfuab__SRAM11)
#define Rectifier_UABH_B_SRAM11_PTR                   ((reg32*)Rectifier_UABH_B_SRAM11_ADDR)
#define Rectifier_UABH_B_SRAM11_REG                   (*(Rectifier_UABH_B_SRAM11_PTR))

#define Rectifier_UABH_B_SRAM12_ADDR                   (Rectifier_UABH_B_halfuab__SRAM12)
#define Rectifier_UABH_B_SRAM12_PTR                   ((reg32*)Rectifier_UABH_B_SRAM12_ADDR)
#define Rectifier_UABH_B_SRAM12_REG                   (*(Rectifier_UABH_B_SRAM12_PTR))

#define Rectifier_UABH_B_SRAM13_ADDR                   (Rectifier_UABH_B_halfuab__SRAM13)
#define Rectifier_UABH_B_SRAM13_PTR                   ((reg32*)Rectifier_UABH_B_SRAM13_ADDR)
#define Rectifier_UABH_B_SRAM13_REG                   (*(Rectifier_UABH_B_SRAM13_PTR))

#define Rectifier_UABH_B_SRAM14_ADDR                   (Rectifier_UABH_B_halfuab__SRAM14)
#define Rectifier_UABH_B_SRAM14_PTR                   ((reg32*)Rectifier_UABH_B_SRAM14_ADDR)
#define Rectifier_UABH_B_SRAM14_REG                   (*(Rectifier_UABH_B_SRAM14_PTR))

#define Rectifier_UABH_B_SRAM15_ADDR                   (Rectifier_UABH_B_halfuab__SRAM15)
#define Rectifier_UABH_B_SRAM15_PTR                   ((reg32*)Rectifier_UABH_B_SRAM15_ADDR)
#define Rectifier_UABH_B_SRAM15_REG                   (*(Rectifier_UABH_B_SRAM15_PTR))

#define Rectifier_UABH_B_SW_CC1_IN0_ADDR               (Rectifier_UABH_B_halfuab__SW_CC1_IN0)
#define Rectifier_UABH_B_SW_CC1_IN0_PTR               ((reg32*)Rectifier_UABH_B_SW_CC1_IN0_ADDR)
#define Rectifier_UABH_B_SW_CC1_IN0_REG               (*(Rectifier_UABH_B_SW_CC1_IN0_PTR))

#define Rectifier_UABH_B_SW_CC1_IN1_ADDR               (Rectifier_UABH_B_halfuab__SW_CC1_IN1)
#define Rectifier_UABH_B_SW_CC1_IN1_PTR               ((reg32*)Rectifier_UABH_B_SW_CC1_IN1_ADDR)
#define Rectifier_UABH_B_SW_CC1_IN1_REG               (*(Rectifier_UABH_B_SW_CC1_IN1_PTR))

#define Rectifier_UABH_B_SW_CC1_TOP_ADDR               (Rectifier_UABH_B_halfuab__SW_CC1_TOP)
#define Rectifier_UABH_B_SW_CC1_TOP_PTR               ((reg32*)Rectifier_UABH_B_SW_CC1_TOP_ADDR)
#define Rectifier_UABH_B_SW_CC1_TOP_REG               (*(Rectifier_UABH_B_SW_CC1_TOP_PTR))

#define Rectifier_UABH_B_CAP_TRIM_ADDR                 (Rectifier_UABH_B_halfuab__CAP_TRIM)
#define Rectifier_UABH_B_CAP_TRIM_PTR                 ((reg32*)Rectifier_UABH_B_CAP_TRIM_ADDR)
#define Rectifier_UABH_B_CAP_TRIM_REG                 (*(Rectifier_UABH_B_CAP_TRIM_PTR))

#define Rectifier_UABH_B_OA_TRIM_ADDR                  (Rectifier_UABH_B_halfuab__OA_TRIM)
#define Rectifier_UABH_B_OA_TRIM_PTR                  ((reg32*)Rectifier_UABH_B_OA_TRIM_ADDR)
#define Rectifier_UABH_B_OA_TRIM_REG                  (*(Rectifier_UABH_B_OA_TRIM_PTR))

/* Starting address for half UAB region */
#define Rectifier_UABH_B_BASE_ADDR                    (Rectifier_UABH_B_halfuab__OA_CTRL)
    



/*Register Field Definitions*/

    
/*UAB_CTRL*/
#define Rectifier_UABH_B_ENABLED_SHIFT                CyUAB_ENABLED_SHIFT
#define Rectifier_UABH_B_ENABLED_MASK                 (1UL<<Rectifier_UABH_B_ENABLED_SHIFT)


/*INTR*/
#if Rectifier_UABH_B_ISODD==1
    #define Rectifier_UABH_B_INTR_COMP_SHIFT CyUAB_INTR_COMP1_SHIFT
#else
    #define Rectifier_UABH_B_INTR_COMP_SHIFT CyUAB_INTR_COMP0_SHIFT
#endif
#define Rectifier_UABH_B_INTR_COMP_MASK               (1UL<<Rectifier_UABH_B_INTR_COMP_SHIFT)

#if Rectifier_UABH_B_ISODD==1
   #define Rectifier_UABH_B_INTR_VDAC_EMPTY_SHIFT CyUAB_INTR_VDAC1_EMPTY_SHIFT
#else
   #define Rectifier_UABH_B_INTR_VDAC_EMPTY_SHIFT CyUAB_INTR_VDAC0_EMPTY_SHIFT
#endif
#define Rectifier_UABH_B_INTR_VDAC_EMPTY_MASK         (1UL<<Rectifier_UABH_B_INTR_VDAC_EMPTY_SHIFT)


/*INTR_SET*/
#define Rectifier_UABH_B_INTR_COMP_SET_SHIFT          Rectifier_UABH_B_INTR_COMP_SHIFT
#define Rectifier_UABH_B_INTR_COMP_SET_MASK           (1UL<<Rectifier_UABH_B_INTR_COMP_SET_SHIFT)

#define Rectifier_UABH_B_INTR_VDAC_EMPTY_SET_SHIFT    Rectifier_UABH_B_INTR_VDAC_EMPTY_SHIFT
#define Rectifier_UABH_B_INTR_VDAC_EMPTY_SET_MASK     (1UL<<Rectifier_UABH_B_INTR_VDAC_EMPTY_SET_SHIFT)


/*INTR_MASK*/
#define Rectifier_UABH_B_INTR_COMP_MASK_SHIFT         Rectifier_UABH_B_INTR_COMP_SHIFT
#define Rectifier_UABH_B_INTR_COMP_MASK_MASK          (1UL<<Rectifier_UABH_B_INTR_COMP_MASK_SHIFT)

#define Rectifier_UABH_B_INTR_VDAC_EMPTY_MASK_SHIFT   Rectifier_UABH_B_INTR_VDAC_EMPTY_SHIFT
#define Rectifier_UABH_B_INTR_VDAC_EMPTY_MASK_MASK    (1UL<<Rectifier_UABH_B_INTR_VDAC_EMPTY_MASK_SHIFT)


/*INTR_MASKED*/
#define Rectifier_UABH_B_INTR_COMP_MASKED_SHIFT       Rectifier_UABH_B_INTR_COMP_SHIFT
#define Rectifier_UABH_B_INTR_COMP_MASKED_MASK        (1UL<<Rectifier_UABH_B_INTR_COMP_MASKED_SHIFT)

#define Rectifier_UABH_B_INTR_VDAC_EMPTY_MASKED_SHIFT Rectifier_UABH_B_INTR_VDAC_EMPTY_SHIFT
#define Rectifier_UABH_B_INTR_VDAC_EMPTY_MASKED_MASK  (1UL<<Rectifier_UABH_B_INTR_VDAC_EMPTY_MASKED_SHIFT)


/*OA_CTRL*/
#define Rectifier_UABH_B_OA_PWR_SHIFT                 CyUAB_OA_PWR_SHIFT
#define Rectifier_UABH_B_OA_PWR_MASK                  (0x7UL<<Rectifier_UABH_B_OA_PWR_SHIFT)

#define Rectifier_UABH_B_CMP_PWR_SHIFT                CyUAB_CMP_PWR_SHIFT
#define Rectifier_UABH_B_CMP_PWR_MASK                 (0x7UL<<Rectifier_UABH_B_CMP_PWR_SHIFT)

#define Rectifier_UABH_B_CMP_EDGE_SHIFT               CyUAB_CMP_EDGE_SHIFT
#define Rectifier_UABH_B_CMP_EDGE_MASK                (0x3UL<<Rectifier_UABH_B_CMP_EDGE_SHIFT)
#define Rectifier_UABH_B_CMP_EDGE_DISABLE             (0UL)
#define Rectifier_UABH_B_CMP_EDGE_RISING              (1UL)
#define Rectifier_UABH_B_CMP_EDGE_FALLING             (2UL)
#define Rectifier_UABH_B_CMP_EDGE_BOTH                (3UL)

#define Rectifier_UABH_B_CMP_DSI_LEVEL_SHIFT          CyUAB_CMP_DSI_LEVEL_SHIFT
#define Rectifier_UABH_B_CMP_DSI_LEVEL_MASK           (1UL<<Rectifier_UABH_B_CMP_DSI_LEVEL_SHIFT)

#define Rectifier_UABH_B_CTRL_SPARE_SHIFT             CyUAB_CTRL_SPARE_SHIFT
#define Rectifier_UABH_B_CTRL_SPARE_MASK              (1UL<<Rectifier_UABH_B_CTRL_SPARE_SHIFT)

#define Rectifier_UABH_B_REF_PWR_SHIFT                CyUAB_REF_PWR_SHIFT
#define Rectifier_UABH_B_REF_PWR_MASK                 (0x7UL<<Rectifier_UABH_B_REF_PWR_SHIFT)

#define Rectifier_UABH_B_REF_PTS_SHIFT                CyUAB_REF_PTS_SHIFT
#define Rectifier_UABH_B_REF_PTS_MASK                 (1UL<<Rectifier_UABH_B_REF_PTS_SHIFT)

