ckuzma/cypress-sensor-hub/PSoC Firmware/EnvironmentSensing.cydsn/Generated_Source/PSoC4/Rectifier_UABH_B_regs.h
#define Rectifier_UABH_B_MODBIT1_SRC_SEL_SHIFT        CyUAB_MODBIT1_SRC_SEL_SHIFT
#define Rectifier_UABH_B_MODBIT1_SRC_SEL_MASK         (0x1fUL<<Rectifier_UABH_B_MODBIT1_SRC_SEL_SHIFT)


/*SW_CA_IN0*/
#define Rectifier_UABH_B_SW_A0_MODBIT_SHIFT           CyUAB_SW_A0_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_A0_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_A0_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_A1_MODBIT_SHIFT           CyUAB_SW_A1_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_A1_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_A1_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_A2_MODBIT_SHIFT           CyUAB_SW_A2_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_A2_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_A2_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_A3_MODBIT_SHIFT           CyUAB_SW_A3_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_A3_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_A3_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_AP_SHIFT                  CyUAB_SW_AP_SHIFT
#define Rectifier_UABH_B_SW_AP_MASK                   (0xfUL<<Rectifier_UABH_B_SW_AP_SHIFT)

#define Rectifier_UABH_B_SW_AQ_SHIFT                  CyUAB_SW_AQ_SHIFT
#define Rectifier_UABH_B_SW_AQ_MASK                   (0xfUL<<Rectifier_UABH_B_SW_AQ_SHIFT)

/*SW_CA_IN1*/    
#define Rectifier_UABH_B_SW_AA_SHIFT                  CyUAB_SW_AA_SHIFT
#define Rectifier_UABH_B_SW_AA_MASK                   (0xfUL<<Rectifier_UABH_B_SW_AA_SHIFT)

#define Rectifier_UABH_B_SW_AR_MODBIT_SHIFT           CyUAB_SW_AR_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_AR_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_AR_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_AG_MODBIT_SHIFT           CyUAB_SW_AG_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_AG_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_AG_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_AV_MODBIT_SHIFT           CyUAB_SW_AV_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_AV_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_AV_MODBIT_SHIFT)


/*SW_CA_TOP*/
#define Rectifier_UABH_B_SW_RA_MODBIT_SHIFT           CyUAB_SW_RA_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_RA_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_RA_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_GA_MODBIT_SHIFT           CyUAB_SW_GA_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_GA_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_GA_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_VA_MODBIT_SHIFT           CyUAB_SW_VA_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_VA_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_VA_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_SA_SHIFT                  CyUAB_SW_SA_SHIFT
#define Rectifier_UABH_B_SW_SA_MASK                   (0xfUL<<Rectifier_UABH_B_SW_SA_SHIFT)


/*SW_CB_IN0*/
#define Rectifier_UABH_B_SW_B0_MODBIT_SHIFT           CyUAB_SW_B0_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_B0_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_B0_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_B1_MODBIT_SHIFT           CyUAB_SW_B1_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_B1_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_B1_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_B2_MODBIT_SHIFT           CyUAB_SW_B2_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_B2_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_B2_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_B3_MODBIT_SHIFT           CyUAB_SW_B3_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_B3_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_B3_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_BP_SHIFT                  CyUAB_SW_BP_SHIFT
#define Rectifier_UABH_B_SW_BP_MASK                   (0xfUL<<Rectifier_UABH_B_SW_BP_SHIFT)

#define Rectifier_UABH_B_SW_BQ_SHIFT                  CyUAB_SW_BQ_SHIFT
#define Rectifier_UABH_B_SW_BQ_MASK                   (0xfUL<<Rectifier_UABH_B_SW_BQ_SHIFT)


/*SW_CB_IN1*/
#define Rectifier_UABH_B_SW_BB_SHIFT                  CyUAB_SW_BB_SHIFT
#define Rectifier_UABH_B_SW_BB_MASK                   (0xfUL<<Rectifier_UABH_B_SW_BB_SHIFT)

#define Rectifier_UABH_B_SW_BR_MODBIT_SHIFT           CyUAB_SW_BR_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_BR_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_BR_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_BG_MODBIT_SHIFT           CyUAB_SW_BG_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_BG_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_BG_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_BV_MODBIT_SHIFT           CyUAB_SW_BV_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_BV_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_BV_MODBIT_SHIFT)


/*SW_CB_TOP*/
#define Rectifier_UABH_B_SW_RB_MODBIT_SHIFT           CyUAB_SW_RB_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_RB_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_RB_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_GB_MODBIT_SHIFT           CyUAB_SW_GB_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_GB_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_GB_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_VB_MODBIT_SHIFT           CyUAB_SW_VB_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_VB_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_VB_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_TB_SHIFT                  CyUAB_SW_TB_SHIFT
#define Rectifier_UABH_B_SW_TB_MASK                   (0xfUL<<Rectifier_UABH_B_SW_TB_SHIFT)

#define Rectifier_UABH_B_SW_SB_SHIFT                  CyUAB_SW_SB_SHIFT
#define Rectifier_UABH_B_SW_SB_MASK                   (0xfUL<<Rectifier_UABH_B_SW_SB_SHIFT)


/*SW_CC_IN0*/
#define Rectifier_UABH_B_SW_C0_MODBIT_SHIFT           CyUAB_SW_C0_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_C0_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_C0_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_C1_MODBIT_SHIFT           CyUAB_SW_C1_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_C1_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_C1_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_C2_MODBIT_SHIFT           CyUAB_SW_C2_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_C2_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_C2_MODBIT_SHIFT)

#define Rectifier_UABH_B_SW_C3_MODBIT_SHIFT           CyUAB_SW_C3_MODBIT_SHIFT
#define Rectifier_UABH_B_SW_C3_MODBIT_MASK            (0xfUL<<Rectifier_UABH_B_SW_C3_MODBIT_SHIFT)

